Revit 2027 API
MacroFailures Properties
The BuiltInFailures.MacroFailures type exposes the following members.
Properties
Name | Description
DuplicateModuleName |  Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
Top
See Also
Reference
BuiltInFailures.MacroFailures Class
Autodesk.Revit.DB Namespace